Revit 2024 API
FluidTemperature Class
 Represents the dynamic viscosity and density properties as defined at a certain temperature.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class FluidTemperature : IDisposable
Visual Basic
Public Class FluidTemperature _
	Implements IDisposable
Visual C++
public ref class FluidTemperature : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.FluidTemperature
See Also
FluidTemperature Members
Autodesk.Revit.DB.Plumbing Namespace